/*

██████╗░██╗░░░██╗░░░░██████╗░██╗░░░██╗░██████╗░█████╗░██╗░░░██╗░██████╗░░█████╗░███╗░░██╗░██████╗░

██╔══██╗╚██╗░██╔╝░░░░██╔══██╗██║░░░██║██╔════╝██╔══██╗██║░░░██║██╔════╝░██╔══██╗████╗░██║██╔════╝░

██████╦╝░╚████╔╝░░░░░██████╔╝██║░░░██║╚█████╗░╚██████║╚██╗░██╔╝██║░░██╗░███████║██╔██╗██║██║░░██╗░

██╔══██╗░░╚██╔╝░░░░░░██╔═══╝░██║░░░██║░╚═══██╗░╚═══██║░╚████╔╝░██║░░╚██╗██╔══██║██║╚████║██║░░╚██╗

██████╦╝░░░██║░░░░░░░██║░░░░░╚██████╔╝██████╔╝░█████╔╝░░╚██╔╝░░╚██████╔╝██║░░██║██║░╚███║╚██████╔╝

╚═════╝░░░░╚═╝░░░░░░░╚═╝░░░░░░╚═════╝░╚═════╝░░╚════╝░░░░╚═╝░░░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

*/

#include <bits/stdc++.h>

using namespace std;



#define Cheats ios::sync_with_stdio(0); cin.tie(0); cout.tie(0);

#define forn(x, n) for(decltype(n) x = 0; x < n; x++) // for [0;n)

#define nl '\n'

#define all(a) a.begin(), a.end()

#define rall(a) a.rbegin(), a.rend()

#define _ << " " <<

#define int long long



// bin pow

int binpow(int a, int b) {

    int res = 1;

    while(b) {

        if(b & 1) res = res * a;

        a = a * a;

        b >>= 1;

    }

    return res;

}



void solve() {

    string s, t;

    cin >> s >> t;

    if (t.length() == 1 && t[0] == 'a') cout << 1 << nl;

    else {

        bool is_a = false;

        for (char item : t) {

            if (item == 'a') {

                is_a = true;

                break;

            }

        }

        if (is_a) cout << -1 << nl;

        else cout << binpow(2, s.length()) << nl;

    }

}



signed main() {

    Cheats;

    int tt;

    cin >> tt;

    while(tt--) {

        solve();

    }

    return 0;

}